yang-8/run/adjointSensorOptimizationFoam/DominikFlow/constant/sensorProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open sensor CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sensorProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alpha                   alpha [0 0 0 0 0 0 0] 0.2;        // Learning rate
end_time                end_time [0 0 0 0 0 0 0] 100;

x_source                x_source [0 0 0 0 0 0 0] 12.0;
y_source                y_source [0 0 0 0 0 0 0] 3.0;

x_sensor_1              x_sensor_1 [0 1 0 0 0 0 0] 9.0;
x_sensor_2              x_sensor_2 [0 1 0 0 0 0 0] 17.86;
x_sensor_3              x_sensor_3 [0 1 0 0 0 0 0] 11.95;
x_sensor_4              x_sensor_4 [0 1 0 0 0 0 0] 1.83;

y_sensor_1              y_sensor_1 [0 1 0 0 0 0 0] 6.0;
y_sensor_2              y_sensor_2 [0 1 0 0 0 0 0] 5.44;
y_sensor_3              y_sensor_3 [0 1 0 0 0 0 0] 8.25;
y_sensor_4              y_sensor_4 [0 1 0 0 0 0 0] 7.97;

x_sensor_5              x_sensor_5 [0 1 0 0 0 0 0] 6.47;
x_sensor_6              x_sensor_6 [0 1 0 0 0 0 0] 9.0;
x_sensor_7              x_sensor_7 [0 1 0 0 0 0 0] 0.14;
x_sensor_8              x_sensor_8 [0 1 0 0 0 0 0] 17.86;

y_sensor_5              y_sensor_5 [0 1 0 0 0 0 0] 11.91;
y_sensor_6              y_sensor_6 [0 1 0 0 0 0 0] 0.09;
y_sensor_7              y_sensor_7 [0 1 0 0 0 0 0] 4.03;
y_sensor_8              y_sensor_8 [0 1 0 0 0 0 0] 10.5;

x_sensor_9              x_sensor_9 [0 1 0 0 0 0 0] 11.53;
x_sensor_10             x_sensor_10 [0 1 0 0 0 0 0] 4.78;
x_sensor_11             x_sensor_11 [0 1 0 0 0 0 0] 7.31;
x_sensor_12             x_sensor_12 [0 1 0 0 0 0 0] 13.64;

y_sensor_9              y_sensor_9 [0 1 0 0 0 0 0] 3.75;
y_sensor_10             y_sensor_10 [0 1 0 0 0 0 0] 2.625;
y_sensor_11             y_sensor_11 [0 1 0 0 0 0 0] 10.5;
y_sensor_12             y_sensor_12 [0 1 0 0 0 0 0] 11.91;

sigma                   sigma [0 0 0 0 0 0 0] 0.1;

// ************************************************************************* //
